Manipulasi Kolom

In [12]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.3
2.1.3

In [ ]:
n_baris=5
n_kolom=2

kolom = ['bil_pecahan', 'bil_bulat']

data = pd.DataFrame(np.random.randint(1,20, size=(n_baris, n_kolom)),columns=kolom)

data['bil_pecahan'] = data['bil_pecahan'].astype('float')

#Menambahkan kolom selanjutnya yang berisi tanggal, tetapi acuannya jam (dia akan bertambah setiap jam)
data.index=pd.date_range(start='2024-01-01', periods=n_baris, freq='H')

#nama kolomnya akan menjadi [index]
data=data.reset_index()

#menambhakan 1 kolom lagi yakni teks
data['teks']=list('ABCDE')

data

C:\Users\rahma\AppData\Local\Temp\ipykernel_17292\3117349501.py:10: FutureWarning: 'H' is deprecated and will be removed in a future version, please use 'h' instead.
  data.index=pd.date_range(start='2024-01-01', periods=n_baris, freq='H')

                index  bil_pecahan  bil_bulat teks
0 2024-01-01 00:00:00         10.0          8    A
1 2024-01-01 01:00:00          4.0         14    B
2 2024-01-01 02:00:00         18.0         12    C
3 2024-01-01 03:00:00          7.0          3    D
4 2024-01-01 04:00:00          4.0         19    E

In [33]:
data.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

Berikut jika kita ingin memanggil tipe-tipe data khsus saja
menggunakan 'number' untuk memanggil tabel angka saja
Hal ini akan memisahkan tabel yang mengandung angka saja untuk dapat diprint

selebihnya pemanggilan int dan float sesuai kebutuhan saja

In [34]:
data.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0         10.0          8
1          4.0         14
2         18.0         12
3          7.0          3
4          4.0         19

In [35]:
data.select_dtypes(include='float')

   bil_pecahan
0         10.0
1          4.0
2         18.0
3          7.0
4          4.0

In [36]:
data.select_dtypes(include= 'int')

   bil_bulat
0          8
1         14
2         12
3          3
4         19

Untuk memanggil tipe data yang berjenis string, khsusus untuk panda sendiri agak beda nih. Kita lebih mengenal istilah 'str' dalam bahasa python sedangkan disini lebih dikenal dengan istilah 'objek' atau "object"

In [37]:
data.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

Untuk jenis data selanjutnya adalah Kalender atau time, kita bisa memanggilnya dengan mudah dengan menuliskan 'datetime'

In [38]:
data.select_dtypes(include='datetime')

                index
0 2024-01-01 00:00:00
1 2024-01-01 01:00:00
2 2024-01-01 02:00:00
3 2024-01-01 03:00:00
4 2024-01-01 04:00:00

Selanjutnya akan muncul pertanyaan mengenai bagaimana cara memanggil dua tipe data yang berbeda, ini mungkin dapat saja terjadi dalam proses pekerjaan nantinya.

kita bisa menggunakan konsep list dalam python kok

In [40]:
data.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0         10.0          8    A
1          4.0         14    B
2         18.0         12    C
3          7.0          3    D
4          4.0         19    E